브라우저는 다음과 같은 과정을 거쳐 렌더링을 수행한다.

1. 브라우저는 HTML, CSS, 자바스크립트, 이미지, 폰트 파일 등 렌더링에 필요한 리소스를 요청하고 서버로부터 응답을 받는다.
2. 브라우저의 렌더링 엔진은 서버로부터 응답된 HTML과 CSS를 파싱하여 DOM과 CSSOM을 생성하고 이들을 결합하여 렌더 트리를 생성한다.
3. 브라우저의 자바스크립트 엔진은 서버로부터 응답된 자바스크립트를 파싱하고 실행한다. 이때 자바스크립트는 DOM API를 통해 DOM이나 CSSOM을 변경할 수 있다. 변경된 DOM과 CSSOM은 다시 렌더 트리로 결합된다.
4. 렌더 트리를 기반으로 HTML 요소의 레이아웃을 계산하고 브라우저 화면에 HTML 요소를 페인팅한다.

# 38.1 요청과 응답

- 브라우저의 주소창에 URL을 입력하고 엔터를 누르면 URL의 호스트 이름이 DNS를 통해 IP주소로 변환되고 IP주소를 갖는 서버에 요청을 전송한다.
- 자바스크립트를 통해 동적으로 서버에 정적/동적 데이터를 요청할 수도 있다.
- HTML을 파싱하는 도중 외부 리소스를 로드하는 태그를 만나면 HTML 파싱을 일시 중단하고 해당 리소스 파일을 서버로 요청한다.

# 38.2 HTTP 1.1과 HTTP 2.0

- HTTP/1.1은 기본적으로 커넥션당 하나의 요청과 응답만 처리한다. 여러 개의 요청을 한 번에 전송할 수 없고 응답 또한 마찬가지다.
- 그러므로 요청할 리소스의 개수에 비례하여 응답 시간도 증가하는 단점이 있다.
- HTTP/2.0은 여러 리소스의 동시 전송이 가능하다.
- 그러므로 HTTP/1.1에 비해 페이지 로드 속도가 약 50%정도 빠르다고 알려져 있다.

# 38.3 HTML 파싱과 DOM 생성

- 브라우저의 렌더링 엔진은 응답받은 HTML 문서를 파싱하여 브라우저가 이해할 수 있는 자료구조인 DOM을 생성한다.
- DOM이 생성되는 과정은 다음과 같다.
    1. 브라우저의 요청에 의해 서버에 저장된 HTML 파일을 바이트(2진수)형식으로 응답한다.
    2. 브라우저는 바이트 형태의 HTML 문서를 meta 태그의 charset 어트리뷰트에 선언된 인코딩 방식(예: UTF-8)을 기준으로 문자열로 변환된다. 참고로 인코딩 방식은 응답 헤더에 담겨 응답된다. 브라우저는 이를 확인하고 문자열로 변환한다.
    3. 변환된 HTML 문서를 읽어 문법적 의미를 갖는 코드의 최소 단위인 토큰들로 분해한다.
    4. 각 토큰을 객체로 변환하여 노드들을 생성한다. 토큰의 내용에 따라 문서 노드, 요소 노드, 어트리뷰트 노드, 텍스트 노드가 생성된다. 노드는 DOM을 구성하는 기본 요소가 된다.
    5. 모든 노드들을 트리 자료구조로 구성한다. 이 노드들로 구성된 트리 자료구조를 DOM이라 부른다.
- 요약: 바이트 → 문자 → 토큰 → 노드 → DOM

# 38.4 CSS 파싱과 CSSOM 생성

- HTML을 파싱하던 중 CSS를 로드하는 link 태그나 style 태그를 만나면 DOM 생성을 일시 중지한다.
- CSS 파일이나 style 태그 내의 CSS를 HTML과 동일한 파싱 과정(바이트 → 문자 → 토큰 → 노드 → CSSOM)을 거치며 CSSOM을 생성한다.
- CSS 파싱을 완료하면 HTML 파싱이 중단된 지점부터 다시 HTML 파싱을 시작한다.
- CSSOM은 CSS의 상속을 반영하여 생성된다. 상위 요소에 적용한 CSS 값은 하위 요소에 상속된다.

# 38.5 렌더 트리 생성

- DOM과 CSSOM은 렌더링을 위해 렌더 트리로 결합된다.
- 렌더 트리에는 화면에 렌더링되지 않는 노드(meta, script 등)와 CSS에 의해 비표시(display: none)되는 노드는 포함하지 않는다.
- 완성된 렌더 트리는 HTML 요소의 레이아웃(위치와 크기)을 계산하는 데 사용되며 브라우저 화면에 픽셀을 렌더링하는 페인팅 처리에 입력된다.
- 다음과 같은 경우 레이아웃과 페인팅이 다시 실행된다.
    - 자바스크립트에 의한 노드 추가 혹은 삭제
    - 브라우저 창의 리사이징에 의한 뷰포트 크기 변경
    - HTML 요소의 레이아웃(위치와 크기)에 변경을 발생시키는 width/height, margin, padding, border, display, position, top/right/bottom/left 등의 스타일 변경

# 38.6 자바스크립트 파싱과 실행

- HTML 파싱 과정 중에 script 태그를 만나게 되면 DOM 생성을 일시 중단한다.
- 자바스크립트 코드를 파싱하기 위해 자바스크립트 엔진에 제어권을 넘긴다. 자바스크립트 파싱과 실행이 종료되면 렌더링 엔진으로 다시 제어권을 넘겨 HTML 파싱을 재개한다.
- 자바스크립트 엔진은 자바스크립트를 해석해서 AST(추상적 구문 트리)를 생성한다.
- 자바스크립트 파싱과 실행 과정은 다음과 같다.
    1. 토크나이징: 문자열을 토큰으로 분해한다.
    2. 파싱: 토큰의 집합을 구문 분석하여 AST를 생성한다.
    3. 바이트코드 생성: 생성된 AST는 인터프리터가 실행할 수 있는 중간 코드인 바이트코드로 변환된다.
    4. 실행
- 문자열 → 토큰 → AST → 바이트코드 → 실행

# 38.7 리플로우와 리페인트

- 자바스크립트 코드에서 DOM API가 사용된 경우 DOM이나 CSSOM이 변경된다. 변경된 DOM과 CSSOM은 다시 렌더트리로 결합되고 레이아웃과 페인트 과정을 거친다. 이를 리플로우와 리페인트라고 한다.
- 리플로우는 레이아웃 계산을 다시 하는 것을 말하며, 노드 추가/삭제, 요소의 크기/위치 변경, 윈도우 리사이징 등 레이아웃에 영향을 주는 변경이 발생한 경우에 한하여 실행된다.
- 리페인트는 재결합된 렌더 트리를 기반으로 다시 페인트를 하는 것을 말한다.

# 38.8 자바스크립트 파싱에 의한 HTML 파싱 중단

- script 태그는 body 태그의 가장 하단에 위치시키는 것이 좋다. 그 이유는 다음과 같다.
    - DOM과 CSSOM이 생성되지 않았는데 DOM API를 사용한다면 문제가 발생할 수 있다.
    - 자바스크립트 파싱으로 인한 HTML 요소들의 렌더링에 지장받는 일이 발생하지 않아 페이지 로딩 시간이 단축된다.

# 38.9 script 태그의 async/defer 어트리뷰트

- 자바스크립트 파싱에 의한 DOM 생성이 중단되는 문제를 해결하기 위해 HTML5부터 script 태그에 async와 defer 어트리뷰트가 추가되었다.
- async/defer 어트리뷰트는 src로 자바스크립트 파일을 로드하는 경우에만 사용 가능하고, 인라인 자바스크립트에는 사용할 수 없다.

### async 어트리뷰트

- HTML 파싱과 자바스크립트 파일의 로드가 비동기적으로 동시에 진행된다.
- 자바스크립트 파일의 로드가 끝나면 즉시 자바스크립트 파싱과 실행을 진행하며, 이때 HTML 파싱이 중단된다.
- script 태그의 순서와는 상관없이 로드가 완료되면 실행하므로 순서 보장이 되지않는다. 그러므로 순서 보장이 필요한 경우 async 어트리뷰트를 지정하지 않아야 한다.

### defer 어트리뷰트

- async 어트리뷰트와 마찬가지로 HTML 파싱과 자바스크립트 파일의 로드를 비동기적으로 동시에 진행된다.
- 하지만 자바스크립트의 파싱과 실행은 HTML 파싱이 완료된 직후(DOM 생성이 완료된 직후)에 진행된다.
